{
    "items": [
        {
            "title": "MBX v1.2: Accelerating data-driven many-body molecular dynamics simulations.",
            "authors": "S. Gupta, E.F. Bull-Vulpe, H. Agnew, S. Iyer, X. Zhu, R. Zhou, C. Knight, F. Paesani",
            "date": "February 14, 2025",
            "citation": "J. Chem. Theory Comput. 21, 1838 (2025).",
            "link": "https://doi.org/10.1021/acs.jctc.4c01333",
            "description": "The MBX software provides an advanced platform for molecular dynamics simulations, leveraging state-of-the-art MB-pol and MB-nrg data-driven many-body potential energy functions. Developed over the past decade, these potential energy functions integrate physics-based and machine-learned many-body terms trained on electronic structure data calculated at the “gold standard” coupled-cluster level of theory. Recent advancements in MBX have focused on optimizing its performance, resulting in the release of MBX v1.2. While the inherently many-body nature of MB-pol and MB-nrg ensures high accuracy, it poses computational challenges. MBX v1.2 addresses these challenges with significant performance improvements, including enhanced parallelism that fully harnesses the power of modern multicore CPUs. These advancements enable simulations on nanosecond time scales for condensed-phase systems, significantly expanding the scope of high-accuracy, predictive simulations of complex molecular systems powered by data-driven many-body potential energy functions.",
            "img_src": "pub202.png"
        },
        {
            "title": "183. MBX: A many-body energy and force calculator for data-driven many-body simulations.",
            "authors": "M. Riera, C. Knight, E.F. Bull-Vulpe, X. Zhu, H. Agnew, D.G.A. Smith, A.C. Simmonett, F. Paesani",
            "date": "February 14, 2025",
            "citation": "J. Chem. Phys. 159, 054802 (2023).",
            "link": "https://doi.org/10.1063/5.0156036",
            "description": "Many-Body eXpansion (MBX) is a C++ library that implements many-body potential energy functions (PEFs) within the “many-body energy” (MB-nrg) formalism. MB-nrg PEFs integrate an underlying polarizable model with explicit machine-learned representations of many-body interactions to achieve chemical accuracy from the gas to the condensed phases. MBX can be employed either as a stand-alone package or as an energy/force engine that can be integrated with generic software for molecular dynamics and Monte Carlo simulations. MBX is parallelized internally using Open Multi-Processing and can utilize Message Passing Interface when available in interfaced molecular simulation software. MBX enables classical and quantum molecular simulations with MB-nrg PEFs, as well as hybrid simulations that combine conventional force fields and MB-nrg PEFs, for diverse systems ranging from small gas-phase clusters to aqueous solutions and molecular fluids to biomolecular systems and metal-organic frameworks.",
            "img_src": "pub183.jpeg"
        }
    ]
}